---
kind: property
id: P:Autodesk.Revit.DB.DirectShapeOptions.RoomBoundingOption
source: html/043a8376-b220-33b1-2707-c3eac7ccd2e3.htm
---
# Autodesk.Revit.DB.DirectShapeOptions.RoomBoundingOption Property

Identifies whether the DirectShape supports an option for the "Room Bounding" parameter to permit participation in room boundary calculations.

## Syntax (C#)
```csharp
public DirectShapeRoomBoundingOption RoomBoundingOption { get; }
```